{"id":7008,"date":"2016-10-20T23:52:52","date_gmt":"2016-10-20T23:52:52","guid":{"rendered":"http:\/\/www.ebenezereyelash.com\/?page_id=7008"},"modified":"2016-10-21T17:30:45","modified_gmt":"2016-10-21T17:30:45","slug":"terms-of-service","status":"publish","type":"page","link":"https:\/\/www.ebenezereyelash.com\/terms-of-service\/","title":{"rendered":"Terms of Service"},"content":{"rendered":"<h2><!-- ATOSPP version: 2.4.8, my_terms_of_service -->    <h2 id='atospp-terms' class='auto-tos-pp tosheading'>Terms of Service:<\/h2>\n    <p>The following terms and conditions govern all use of the ebenezereyelash.com website and all\n        content,\n        services and products available at or through the website (taken together, the Website). The Website is owned\n        and operated by Ebenezer Eyelash Extension (&quot;Ebenezer Eyelash Extension&quot;). The Website is\n        offered subject to your acceptance without modification of all of the terms and conditions contained herein and\n        all other operating rules, policies (including, without\n        limitation, Ebenezer Eyelash Extension's Privacy Policy) and procedures that may be\n        published from time to time on this Site by Ebenezer Eyelash Extension (collectively, the &quot;Agreement&quot;).<\/p>\n    <p>Please read this Agreement carefully before accessing or using the Website. By accessing or using any part of the\n        web site, you agree to become bound by the terms and conditions of this agreement. If you do not agree to all\n        the terms and conditions of this agreement, then you may not access the Website or use any services. If these\n        terms and conditions are considered an offer by Ebenezer Eyelash Extension, acceptance is expressly limited to\n        these terms. The Website is available only to individuals who are at least 13 years\n        old.<\/p>\n    <ol>\n        <li><strong>Your ebenezereyelash.com Account and Site.<\/strong> If you create a blog\/site on the\n            Website, you are responsible for maintaining the security of your account and blog, and you are fully\n            responsible for all activities that occur under the account and any other actions taken in connection with\n            the blog. You must not describe or assign keywords to your blog in a misleading or unlawful manner,\n            including in a manner intended to trade on the name or reputation of others, and Ebenezer Eyelash Extension            may change or remove any description or keyword that it considers inappropriate or unlawful, or otherwise\n            likely to cause Ebenezer Eyelash Extension liability. You must immediately\n            notify Ebenezer Eyelash Extension of any unauthorized uses of your blog, your account or any other breaches\n            of security. Ebenezer Eyelash Extension will not be liable for any acts or omissions by You, including any\n            damages of any kind incurred as a result of such acts or omissions.\n        <\/li>\n        <li><strong>Responsibility of Contributors.<\/strong> If you operate a blog, comment on a blog, post material to\n            the Website, post links on the Website, or otherwise make (or allow any third party to make) material\n            available by means of the Website (any such material, &quot;Content&quot;), You are entirely responsible for\n            the content of, and any harm resulting from, that Content. That is the case regardless of whether the\n            Content in question constitutes text, graphics, an audio file, or computer software. By making Content\n            available, you represent and warrant that:\n            <ul>\n                <li>the downloading, copying and use of the Content will not infringe the proprietary rights, including\n                    but not limited to the copyright, patent, trademark or trade secret rights, of any third party;\n                <\/li>\n                <li>if your employer has rights to intellectual property you create, you have either (i) received\n                    permission from your employer to post or make available the Content, including but not limited to\n                    any software, or (ii) secured from your employer a waiver as to all rights in or to the Content;\n                <\/li>\n                <li>you have fully complied with any third-party licenses relating to the Content, and have done all\n                    things necessary to successfully pass through to end users any required terms;\n                <\/li>\n                <li>the Content does not contain or install any viruses, worms, malware, Trojan horses or other harmful\n                    or destructive content;\n                <\/li>\n                <li class='important'>the Content is not spam, is not machine- or randomly-generated, and does not\n                    contain unethical or unwanted commercial content designed to drive traffic to third party sites or\n                    boost the search engine rankings of third party sites, or to further unlawful acts (such as\n                    phishing) or mislead recipients as to the source of the material (such as spoofing);\n                <\/li>\n                <li>the Content is not pornographic, does not contain threats or incite violence towards individuals or\n                    entities, and does not violate the privacy or publicity rights of any third party;\n                <\/li>\n                <li>your blog is not getting advertised via unwanted electronic messages such as spam links on\n                    newsgroups, email lists, other blogs and web sites, and similar unsolicited promotional methods;\n                <\/li>\n                <li>your blog is not named in a manner that misleads your readers into thinking that you are another\n                    person or company. For example, your blog's URL or name is not the name of a person other than\n                    yourself or company other than your own; and\n                <\/li>\n                <li>you have, in the case of Content that includes computer code, accurately categorized and\/or\n                    described the type, nature, uses and effects of the materials, whether requested to do so by\n\t\t\t\t\tEbenezer Eyelash Extension or otherwise.\n                <\/li>\n            <\/ul>\n            <p>By submitting Content to Ebenezer Eyelash Extension for inclusion on your Website, you\n                grant Ebenezer Eyelash Extension a world-wide, royalty-free, and non-exclusive license to reproduce,\n                modify, adapt and publish the Content solely for the purpose of displaying, distributing and promoting\n                your blog. If you delete Content, Ebenezer Eyelash Extension will use reasonable efforts to remove it\n                from the Website, but you acknowledge that caching or references to the Content may not be made\n                immediately unavailable.<\/p>\n            <p>Without limiting any of those representations or warranties, Ebenezer Eyelash Extension has the right\n                (though not the obligation) to, in Ebenezer Eyelash Extension's sole discretion (i) refuse or\n                remove any content that, in Ebenezer Eyelash Extension's reasonable opinion, violates\n                any Ebenezer Eyelash Extension policy or is in any way harmful or objectionable, or (ii) terminate or\n                deny access to and use of the Website to any individual or entity for any reason,\n                in Ebenezer Eyelash Extension's sole discretion. Ebenezer Eyelash Extension will have no\n                obligation to provide a refund of any amounts previously paid.<\/li>\n        <li><strong>Payment and Renewal.<\/strong>\n            <ul>\n                <li><strong>General Terms.<\/strong><br>\n                    By selecting a product or service, you agree to pay Ebenezer Eyelash Extension the one-time and\/or\n                    monthly or\n                    annual subscription fees indicated (additional payment terms may be included in other\n                    communications). Subscription payments will be charged on a pre-pay basis on the day you sign up for\n                    an Upgrade and will cover the use of that service for a monthly or annual subscription period as\n                    indicated. Payments are not refundable.\n                <\/li>\n                <li><strong>Automatic Renewal. <\/strong><br>\n                    Unless you notify Ebenezer Eyelash Extension before the end of the applicable subscription period\n                    that you want\n                    to cancel a subscription, your subscription will automatically renew and you authorize us to collect\n                    the then-applicable annual or monthly subscription fee for such subscription (as well as any taxes)\n                    using any credit card or other payment mechanism we have on record for you. Upgrades can be canceled\n                    at any time by submitting your request to Ebenezer Eyelash Extension in writing.\n                <\/li>\n            <\/ul>\n        <\/li>\n        <li><strong>Services.<\/strong>\n            <ul>\n                <li><strong>Fees; Payment. <\/strong>By signing up for a Services account you agree to\n                    pay Ebenezer Eyelash Extension                    the applicable setup fees and recurring fees. Applicable fees will be invoiced starting from the day\n                    your services are established and in advance of using such services. Ebenezer Eyelash Extension                    reserves the\n                    right to change the payment terms and fees\n                    upon thirty (30) days                    prior written notice to you. Services can be canceled by you at anytime on\n\t\t\t\t\tthirty (30) days written notice\n                    to Ebenezer Eyelash Extension.\n                <\/li>\n                <li><strong>Support.<\/strong> If your service includes access to priority email support. &quot;Email\n                    support&quot; means the ability to make requests for technical support assistance by email at any\n                    time (with reasonable efforts by Ebenezer Eyelash Extension to respond within\n\t\t\t\t\tone business day) concerning the use of the VIP Services.\n                    &quot;Priority&quot;\n                    means that support takes priority over support for users of the standard or\n                    free ebenezereyelash.com                    services. All support will be provided in accordance\n                    with Ebenezer Eyelash Extension standard services practices,\n                    procedures and policies.\n                <\/li>\n            <\/ul>\n        <li><strong>Responsibility of Website Visitors.<\/strong> Ebenezer Eyelash Extension has not reviewed, and\n            cannot review, all\n            of the material, including computer software, posted to the Website, and cannot therefore be responsible for\n            that material's content, use or effects. By operating the Website, Ebenezer Eyelash Extension does not\n            represent or imply\n            that it endorses the material there posted, or that it believes such material to be accurate, useful or\n            non-harmful. You are responsible for taking precautions as necessary to protect yourself and your computer\n            systems from viruses, worms, Trojan horses, and other harmful or destructive content. The Website may\n            contain content that is offensive, indecent, or otherwise objectionable, as well as content containing\n            technical inaccuracies, typographical mistakes, and other errors. The Website may also contain material that\n            violates the privacy or publicity rights, or infringes the intellectual property and other proprietary\n            rights, of third parties, or the downloading, copying or use of which is subject to additional terms and\n            conditions, stated or unstated. Ebenezer Eyelash Extension disclaims any responsibility for any harm\n            resulting from the\n            use by visitors of the Website, or from any downloading by those visitors of content there posted.\n        <\/li>\n        <li><strong>Content Posted on Other Websites.<\/strong> We have not reviewed, and cannot review, all of the\n            material, including computer software, made available through the websites and webpages to which\n\t\t\tebenezereyelash.com links, and that link to ebenezereyelash.com.\n\t\t\tEbenezer Eyelash Extension does not have any control over those non-Ebenezer Eyelash Extension websites\n            and webpages, and is not responsible for their contents or their use. By linking to a\n            non-Ebenezer Eyelash Extension website or webpage, Ebenezer Eyelash Extension does not represent or imply\n            that it endorses such website or webpage. You are responsible for taking precautions as necessary to protect\n            yourself and your computer systems from viruses, worms, Trojan horses, and other harmful or destructive\n            content. Ebenezer Eyelash Extension disclaims any responsibility for any harm resulting from your use of\n            non-Ebenezer Eyelash Extension websites and webpages.\n        <\/li>\n        <li><strong>Copyright Infringement and DMCA Policy.<\/strong> As Ebenezer Eyelash Extension asks others to\n            respect its\n            intellectual property rights, it respects the intellectual property rights of others. If you believe that\n            material located on or linked to by ebenezereyelash.com violates your copyright, you are\n            encouraged to notify Ebenezer Eyelash Extension in accordance with Ebenezer Eyelash Extension's Digital Millennium Copyright Act (&quot;DMCA&quot;) Policy.\n\t\t\tEbenezer Eyelash Extension will respond to all such notices, including as required or appropriate by\n            removing the infringing material or disabling all links to the infringing\n            material. Ebenezer Eyelash Extension will terminate a visitor's access to and use of the Website if, under\n            appropriate circumstances, the visitor is determined to be a repeat infringer of the copyrights or other\n            intellectual property rights of Ebenezer Eyelash Extension or others. In the case of such\n            termination, Ebenezer Eyelash Extension will have no obligation to provide a refund of any amounts\n            previously paid to Ebenezer Eyelash Extension.\n        <\/li>\n        <li><strong>Intellectual Property.<\/strong> This Agreement does not transfer from Ebenezer Eyelash Extension            to you any Ebenezer Eyelash Extension or third party intellectual property, and all right, title and\n            interest in and to such property will remain (as between the parties) solely\n            with Ebenezer Eyelash Extension. Ebenezer Eyelash Extension, ebenezereyelash.com,\n            the ebenezereyelash.com logo, and all other trademarks, service marks, graphics and logos used\n            in connection with ebenezereyelash.com, or the Website are trademarks or registered trademarks\n            of Ebenezer Eyelash Extension or Ebenezer Eyelash Extension's licensors. Other trademarks, service\n            marks, graphics and logos used in connection with the Website may be the trademarks of other third parties.\n            Your use of the Website grants you no right or license to reproduce or otherwise use\n            any Ebenezer Eyelash Extension or third-party trademarks.\n        <\/li>\n        <li><strong>Advertisements.<\/strong> Ebenezer Eyelash Extension reserves the right to display advertisements\n            on your blog unless you have purchased an ad-free account.\n        <\/li>\n        <li><strong>Attribution.<\/strong> Ebenezer Eyelash Extension reserves the right to display attribution links\n            such as 'Blog at ebenezereyelash.com,' theme author, and font attribution in your blog footer\n            or toolbar.\n        <\/li>\n        <li><strong>Partner Products.<\/strong> By activating a partner product (e.g. theme) from one of our partners,\n            you agree to that partner's terms of service. You can opt out of their terms of service at any time by\n            de-activating the partner product.\n        <\/li>\n        <li><strong>Domain Names.<\/strong> If you are registering a domain name, using or transferring a previously\n            registered domain name, you acknowledge and agree that use of the domain name is also subject to the\n            policies of the Internet Corporation for Assigned Names and Numbers (&quot;ICANN&quot;), including their <a\n                    href='http:\/\/www.icann.org\/en\/registrars\/registrant-rights-responsibilities-en.htm'>Registration\n                Rights and Responsibilities<\/a>.\n        <\/li>\n        <li><strong>Changes. <\/strong>Ebenezer Eyelash Extension reserves the right, at its sole discretion, to modify\n            or replace any\n            part of this Agreement. It is your responsibility to check this Agreement periodically for changes. Your\n            continued use of or access to the Website following the posting of any changes to this Agreement constitutes\n            acceptance of those changes. Ebenezer Eyelash Extension may also, in the future, offer new services and\/or\n            features\n            through the Website (including, the release of new tools and resources). Such new features and\/or services\n            shall be subject to the terms and conditions of this Agreement. <strong><br>\n            <\/strong><\/li>\n        <li><strong>Termination. <\/strong>Ebenezer Eyelash Extension may terminate your access to all or any part of\n            the Website at\n            any time, with or without cause, with or without notice, effective immediately. If you wish to terminate\n            this Agreement or your ebenezereyelash.com account (if you have one), you may simply\n            discontinue\n            using the\n            Website. Notwithstanding the foregoing, if you have a paid services account, such account can only be\n            terminated by Ebenezer Eyelash Extension if you materially breach this Agreement and fail to cure such\n            breach within\n\t\t\tthirty (30) days            from Ebenezer Eyelash Extension's notice to you thereof;\n            provided that, Ebenezer Eyelash Extension can terminate the Website immediately as part of a general shut\n            down of our\n            service. All provisions of this Agreement which by their nature should survive termination shall survive\n            termination, including, without limitation, ownership provisions, warranty disclaimers, indemnity and\n            limitations of liability. <strong><br>\n            <\/strong><\/li>\n        <li class='important'><strong>Disclaimer of Warranties.<\/strong> The Website is provided &quot;as is&quot;.\n\t\t\tEbenezer Eyelash Extension and its suppliers and licensors hereby disclaim all warranties of any kind,\n            express or\n            implied, including, without limitation, the warranties of merchantability, fitness for a particular purpose\n            and non-infringement. Neither Ebenezer Eyelash Extension nor its suppliers and licensors, makes any\n            warranty that the\n            Website will be error free or that access thereto will be continuous or uninterrupted. You understand that\n            you download from, or otherwise obtain content or services through, the Website at your own discretion and\n            risk.\n        <\/li>\n        <li class='important'><strong>Limitation of Liability.<\/strong> In no event will Ebenezer Eyelash Extension,\n            or its suppliers\n            or licensors, be liable with respect to any subject matter of this agreement under any contract, negligence,\n            strict liability or other legal or equitable theory for: (i) any special, incidental or consequential\n            damages; (ii) the cost of procurement for substitute products or services; (iii) for interruption of use or\n            loss or corruption of data; or (iv) for any amounts that exceed the fees paid by you\n            to Ebenezer Eyelash Extension under this agreement during\n            the twelve (12) month period prior to the cause of\n            action. Ebenezer Eyelash Extension shall have no liability for any failure or delay due to matters beyond\n            their reasonable control. The foregoing shall not apply to the extent prohibited by applicable law.\n        <\/li>\n        <li><strong>General Representation and Warranty.<\/strong> You represent and warrant that (i) your use of the\n            Website will be in strict accordance with\n            the Ebenezer Eyelash Extension Privacy Policy, with this Agreement\n            and with all applicable laws and regulations (including without limitation any local laws or regulations in\n            your country, state, city, or other governmental area, regarding online conduct and acceptable content, and\n            including all applicable laws regarding the transmission of technical data exported from the United States\n            or the country in which you reside) and (ii) your use of the Website will not infringe or misappropriate the\n            intellectual property rights of any third party.\n        <\/li>\n        <li><strong>Indemnification.<\/strong> You agree to indemnify and hold harmless Ebenezer Eyelash Extension, its\n            contractors,\n            and its licensors, and their respective directors, officers, employees and agents from and against any and\n            all claims and expenses, including attorneys' fees, arising out of your use of the Website, including but\n            not limited to your violation of this Agreement.\n        <\/li>\n        <li><strong>Miscellaneous.<\/strong> This Agreement constitutes the entire agreement\n            between Ebenezer Eyelash Extension and\n            you concerning the subject matter hereof, and they may only be modified by a written amendment signed by an\n            authorized executive of Ebenezer Eyelash Extension, or by the posting by Ebenezer Eyelash Extension of a\n            revised version. Except to\n            the extent applicable law, if any, provides otherwise, this Agreement, any access to or use of the Website\n            will be governed by the laws of the State of New York, U.S.A., excluding its conflict of law provisions,\n            and the proper\n            venue for any disputes arising out of or relating to any of the same will be the state and federal courts\n            located in New York County, New York. Except for claims for injunctive or equitable relief or\n            claims regarding\n            intellectual property rights (which may be brought in any competent court without the posting of a bond),\n            any dispute arising under this Agreement shall be finally settled in accordance with the Comprehensive\n            Arbitration Rules of the Judicial Arbitration and Mediation Service, Inc. (&quot;JAMS&quot;) by three\n            arbitrators appointed in accordance with such Rules. The arbitration shall take place in\n\t\t\tNew York, New York, in the English language and the arbitral decision may be\n            enforced\n            in any court.\n            The prevailing party in any action or proceeding to enforce this Agreement shall be entitled to costs and\n            attorneys' fees. If any part of this Agreement is held invalid or unenforceable, that part will be construed\n            to reflect the parties' original intent, and the remaining portions will remain in full force and effect. A\n            waiver by either party of any term or condition of this Agreement or any breach thereof, in any one\n            instance, will not waive such term or condition or any subsequent breach thereof. You may assign your rights\n            under this Agreement to any party that consents to, and agrees to be bound by, its terms and conditions;\n\t\t\tEbenezer Eyelash Extension may assign its rights under this Agreement without condition. This Agreement\n            will be binding\n            upon and will inure to the benefit of the parties, their successors and permitted assigns.\n        <\/li>\n    <\/ol>\n<\/h2>\n<br \/>\n<h2>Gift Certificate Terms &amp; Conditions<\/h2>\n<h4>Use of gift certificate constitutes acceptance of the following terms and conditions:<\/h4>\n<p>This certificate is not replaceable if lost or stolen and should be treated as cash. Neither Ebenezer Eyelash nor any channel partner nor any partner spa is responsible for loss, theft or mutilation of this certificate. This certificate can not be redeemed for cash except in accordance with applicable law. Face value of certificate in the currency identified on the certificate. Unauthorized resale will invalidate this certificate. When properly authorized, this certificate may be redeemed for services at any of the Ebenezer Eyelash location.<\/p>\n<p>Gift certificates are subject to the expiration date, if any, set forth on the face of the certificate, except where prohibited by applicable law. Ebenezer Eyelash makes no warranty of any kind regarding any service you may receive in connection with your use and redemption of this certificate.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Gift Certificate Terms &amp; Conditions Use of gift certificate constitutes acceptance of the following terms and conditions: This certificate is not replaceable if lost or stolen and should be treated as cash. Neither Ebenezer Eyelash nor any channel partner nor any partner spa is responsible for loss, theft or mutilation of this certificate. This certificate&#8230;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.3 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms of Service - The Best Eyelash Extensions in NYC – Ebenezer Eyelash Extension<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.ebenezereyelash.com\/terms-of-service\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms of Service - The Best Eyelash Extensions in NYC – Ebenezer Eyelash Extension\" \/>\n<meta property=\"og:description\" content=\"Gift Certificate Terms &amp; Conditions Use of gift certificate constitutes acceptance of the following terms and conditions: This certificate is not replaceable if lost or stolen and should be treated as cash. Neither Ebenezer Eyelash nor any channel partner nor any partner spa is responsible for loss, theft or mutilation of this certificate. This certificate...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.ebenezereyelash.com\/terms-of-service\/\" \/>\n<meta property=\"og:site_name\" content=\"The Best Eyelash Extensions in NYC – Ebenezer Eyelash Extension\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/ebenezerdentalny\" \/>\n<meta property=\"article:modified_time\" content=\"2016-10-21T17:30:45+00:00\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"1 minute\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.ebenezereyelash.com\/#website\",\"url\":\"https:\/\/www.ebenezereyelash.com\/\",\"name\":\"The Best Eyelash Extensions in NYC \\u2013 Ebenezer Eyelash Extension\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.ebenezereyelash.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.ebenezereyelash.com\/terms-of-service\/#webpage\",\"url\":\"https:\/\/www.ebenezereyelash.com\/terms-of-service\/\",\"name\":\"Terms of Service - The Best Eyelash Extensions in NYC \\u2013 Ebenezer Eyelash Extension\",\"isPartOf\":{\"@id\":\"https:\/\/www.ebenezereyelash.com\/#website\"},\"datePublished\":\"2016-10-20T23:52:52+00:00\",\"dateModified\":\"2016-10-21T17:30:45+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.ebenezereyelash.com\/terms-of-service\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.ebenezereyelash.com\/terms-of-service\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.ebenezereyelash.com\/terms-of-service\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.ebenezereyelash.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Terms of Service\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Terms of Service - The Best Eyelash Extensions in NYC – Ebenezer Eyelash Extension","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.ebenezereyelash.com\/terms-of-service\/","og_locale":"en_US","og_type":"article","og_title":"Terms of Service - The Best Eyelash Extensions in NYC – Ebenezer Eyelash Extension","og_description":"Gift Certificate Terms &amp; Conditions Use of gift certificate constitutes acceptance of the following terms and conditions: This certificate is not replaceable if lost or stolen and should be treated as cash. Neither Ebenezer Eyelash nor any channel partner nor any partner spa is responsible for loss, theft or mutilation of this certificate. This certificate...","og_url":"https:\/\/www.ebenezereyelash.com\/terms-of-service\/","og_site_name":"The Best Eyelash Extensions in NYC – Ebenezer Eyelash Extension","article_publisher":"https:\/\/www.facebook.com\/ebenezerdentalny","article_modified_time":"2016-10-21T17:30:45+00:00","twitter_misc":{"Est. reading time":"1 minute"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.ebenezereyelash.com\/#website","url":"https:\/\/www.ebenezereyelash.com\/","name":"The Best Eyelash Extensions in NYC – Ebenezer Eyelash Extension","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.ebenezereyelash.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.ebenezereyelash.com\/terms-of-service\/#webpage","url":"https:\/\/www.ebenezereyelash.com\/terms-of-service\/","name":"Terms of Service - The Best Eyelash Extensions in NYC – Ebenezer Eyelash Extension","isPartOf":{"@id":"https:\/\/www.ebenezereyelash.com\/#website"},"datePublished":"2016-10-20T23:52:52+00:00","dateModified":"2016-10-21T17:30:45+00:00","breadcrumb":{"@id":"https:\/\/www.ebenezereyelash.com\/terms-of-service\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.ebenezereyelash.com\/terms-of-service\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.ebenezereyelash.com\/terms-of-service\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.ebenezereyelash.com\/"},{"@type":"ListItem","position":2,"name":"Terms of Service"}]}]}},"_links":{"self":[{"href":"https:\/\/www.ebenezereyelash.com\/wp-json\/wp\/v2\/pages\/7008"}],"collection":[{"href":"https:\/\/www.ebenezereyelash.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.ebenezereyelash.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.ebenezereyelash.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.ebenezereyelash.com\/wp-json\/wp\/v2\/comments?post=7008"}],"version-history":[{"count":1,"href":"https:\/\/www.ebenezereyelash.com\/wp-json\/wp\/v2\/pages\/7008\/revisions"}],"predecessor-version":[{"id":7053,"href":"https:\/\/www.ebenezereyelash.com\/wp-json\/wp\/v2\/pages\/7008\/revisions\/7053"}],"wp:attachment":[{"href":"https:\/\/www.ebenezereyelash.com\/wp-json\/wp\/v2\/media?parent=7008"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}